# MOSCOW NEVER SLEEP ЯЯЯЯ ЛЮБЛЮ ТЕБЯЯЯЯ МАСКВААААА
moscow_subway_stations = {
    "Сокольническая линия (красная)": [
        "Бульвар Рокоссовского", "Черкизовская", "Преображенская площадь", "Сокольники",
        "Красносельская", "Комсомольская", "Красные Ворота", "Чистые пруды", "Лубянка",
        "Охотный ряд", "Библиотека имени Ленина", "Кропоткинская", "Парк культуры",
        "Фрунзенская", "Спортивная", "Воробьёвы горы", "Университет", "Проспект Вернадского",
        "Юго-Западная", "Тропарёво", "Румянцево", "Саларьево", "Филатов Луг", "Прокшино",
        "Ольховая", "Коммунарка"
    ],
    "Замоскворецкая линия (зелёная)": [
        "Ховрино", "Беломорская", "Речной вокзал", "Водный стадион", "Войковская", "Сокол",
        "Аэропорт", "Динамо", "Белорусская", "Маяковская", "Тверская", "Театральная",
        "Новокузнецкая", "Павелецкая", "Автозаводская", "Технопарк", "Коломенская",
        "Каширская", "Кантемировская", "Царицыно", "Орехово", "Домодедовская",
        "Красногвардейская", "Алма-Атинская"
    ],
    "Арбатско-Покровская линия (синяя)": [
        "Щёлковская", "Первомайская", "Измайловская", "Партизанская", "Семеновская",
        "Электрозаводская", "Бауманская", "Курская", "Площадь Революции", "Арбатская",
        "Смоленская", "Киевская", "Парк Победы", "Славянский бульвар", "Кунцевская",
        "Молодёжная", "Крылатское", "Строгино", "Мякинино", "Волоколамская", "Митино",
        "Пятницкое шоссе"
    ],
    "Филёвская линия (голубая)": [
        "Александровский сад", "Арбатская", "Смоленская", "Киевская", "Выставочная",
        "Деловой центр", "Кутузовская", "Студенческая", "Фили", "Багратионовская",
        "Филёвский парк", "Пионерская", "Кунцевская"
    ],
    "Кольцевая линия (коричневая)": [
        "Парк культуры", "Октябрьская", "Добрынинская", "Павелецкая", "Таганская",
        "Курская", "Комсомольская", "Проспект Мира", "Новослободская", "Белорусская",
        "Краснопресненская", "Киевская"
    ],
    "Калужско-Рижская линия (оранжевая)": [
        "Медведково", "Бабушкинская", "Свиблово", "Ботанический сад", "ВДНХ",
        "Алексеевская", "Рижская", "Проспект Мира", "Сухаревская", "Тургеневская",
        "Китай-город", "Третьяковская", "Октябрьская", "Шаболовская", "Ленинский проспект",
        "Академическая", "Профсоюзная", "Новые Черёмушки", "Калужская", "Беляево",
        "Коньково", "Тёплый стан", "Ясенево", "Новоясеневская"
    ],
    "Таганско-Краснопресненская линия (фиолетовая)": [
        "Планерная", "Сходненская", "Тушинская", "Щукинская", "Октябрьское поле",
        "Полежаевская", "Беговая", "Улица 1905 года", "Баррикадная", "Пушкинская",
        "Кузнецкий мост", "Китай-город", "Таганская", "Пролетарская",
        "Волгоградский проспект", "Текстильщики", "Кузьминки", "Рязанский проспект",
        "Выхино", "Лермонтовский проспект", "Жулебино", "Котельники"
    ],
    "Калининская линия (жёлтая)": [
        "Новокосино", "Новогиреево", "Перово", "Шоссе Энтузиастов",
        "Авиамоторная", "Площадь Ильича", "Марксистская", "Третьяковская"
    ],
    "Серпуховско-Тимирязевская линия (серая)": [
        "Алтуфьево", "Бибирево", "Отрадное", "Владыкино", "Петровско-Разумовская",
        "Тимирязевская", "Дмитровская", "Савёловская", "Менделеевская", "Цветной бульвар",
        "Чеховская", "Боровицкая", "Полянка", "Серпуховская", "Тульская", "Нагатинская",
        "Нагорная", "Нахимовский проспект", "Севастопольская", "Чертановская", "Южная",
        "Пражская", "Улица Академика Янгеля", "Аннино", "Бульвар Дмитрия Донского"
    ],
    "Люблинско-Дмитровская линия (салатовая)": [
        "Селигерская", "Верхние Лихоборы", "Окружная", "Петровско-Разумовская",
        "Фонвизинская", "Бутырская", "Марьина роща", "Достоевская", "Трубная",
        "Сретенский бульвар", "Чкаловская", "Римская", "Крестьянская застава",
        "Дубровка", "Кожуховская", "Печатники", "Волгоградский проспект", "Текстильщики"
    ],
    "Большая кольцевая линия (лаймовая)": [
        "Деловой центр", "Шелепиха", "Хорошёвская", "ЦСКА", "Петровский парк",
        "Савёловская", "Марьина роща", "Рижская", "Сокольники", "Лефортово",
        "Авиамоторная", "Электрозаводская", "Нижегородская", "Печатники",
        "Кленовый бульвар", "Каширская", "Варшавская", "Каховская", "Зюзино",
        "Новаторская", "Воронцовская", "Аминьевская", "Давыдково", "Кунцевская"
    ],
    "Московское центральное кольцо (МЦК)": [
        "Балтийская", "Белокаменная", "Ботанический сад", "Булвар Рокоссовского",
        "Владыкино", "Деловой центр", "Зорге", "Измайлово", "Коптево",
        "Кутузовская", "Лихоборы", "Лужники", "Панфиловская", "Площадь Гагарина",
        "Ростокино", "Сити", "Соколиная гора", "Стрешнево", "Шелепиха"
    ],
    "МЦД-1 (Белорусско-Савёловское направление)": [
        "Лобня", "Шереметьевская", "Окружная", "Тимирязевская", "Савёловская",
        "Белорусская", "Беговая", "Тестовская", "Кутузовская", "Фили", "Славянский бульвар",
        "Рабочий Посёлок", "Одинцово"
    ],
    "МЦД-2 (Курско-Рижское направление)": [
        "Нахабино", "Красногорская", "Пенягино", "Волоколамская", "Тушинская",
        "Щукинская", "Стрешнево", "Ленинградская", "Каланчёвская", "Курская",
        "Москва-Товарная", "Текстильщики", "Люблино", "Курьяново", "Москворечье"
    ],
    "МЦД-3 (Ленинградско-Казанское направление)": [
        "Зеленоград", "Крюково", "Химки", "Лобня", "Окружная", "Рижская",
        "Каланчёвская", "Курская", "Печатники", "Текстильщики", "Люблино"
    ],
    "МЦД-4 (Киевско-Горьковское направление)": [
        "Апрелевка", "Кокошкино", "Переделкино", "Сколково", "Славянский бульвар",
        "Киевская", "Каланчёвская", "Курская", "Текстильщики", "Люблино", "Домодедово"
    ]
}

# В ПИТЕРЕ ПИТЬ
spb_subway_stations = {
    "Кировско-Выборгская линия (красная)": [
        "Девяткино", "Гражданский проспект", "Академическая", "Политехническая",
        "Площадь Мужества", "Лесная", "Выборгская", "Площадь Ленина", "Чернышевская",
        "Площадь Восстания", "Владимирская", "Пушкинская", "Технологический институт",
        "Балтийская", "Нарвская", "Кировский завод", "Автово", "Ленинский проспект",
        "Проспект Ветеранов"
    ],
    "Московско-Петроградская линия (синяя)": [
        "Парнас", "Проспект Просвещения", "Озерки", "Удельная", "Пионерская",
        "Черная речка", "Петроградская", "Горьковская", "Невский проспект",
        "Сенная площадь", "Технологический институт", "Фрунзенская", "Московские ворота",
        "Электросила", "Парк Победы", "Московская", "Звездная", "Купчино"
    ],
    "Невско-Василеостровская линия (зелёная)": [
        "Беговая", "Приморская", "Василеостровская", "Гостиный двор", "Маяковская",
        "Площадь Александра Невского", "Елизаровская", "Ломоносовская", "Пролетарская",
        "Обухово", "Рыбацкое"
    ],
    "Правобережная линия (оранжевая)": [
        "Спасская", "Достоевская", "Лиговский проспект", "Новочеркасская",
        "Ладожская", "Проспект Большевиков", "Улица Дыбенко"
    ],
    "Фрунзенско-Приморская линия (фиолетовая)": [
        "Комендантский проспект", "Старая деревня", "Крестовский остров", "Чкаловская",
        "Спортивная", "Адмиралтейская", "Садовая", "Звенигородская", "Обводный канал",
        "Волковская", "Бухарестская", "Международная", "Проспект Славы",
        "Дунайская", "Шушары"
    ]
}

# НОВОСИБИРСК
novosibirsk_subway_stations = {
    "Ленинская линия (красная)": [
        "Площадь Маркса", "Студенческая", "Речной вокзал", "Октябрьская",
        "Площадь Ленина", "Красный проспект", "Гагаринская", "Заельцовская"
    ],
    "Дзержинская линия (зелёная)": [
        "Золотая Нива", "Берёзовая роща", "Маршала Покрышкина", "Сибирская",
        "Площадь Гарина-Михайловского"
    ]
}

# НН
nizhny_novgorod_subway_stations = {
    "Автозаводская линия (красная)": [
        "Парк Культуры", "Кировская", "Комсомольская", "Автозаводская",
        "Пролетарская", "Двигатель Революции", "Ленинская", "Чкаловская",
        "Московская", "Горьковская"
    ],
    "Сормовско-Мещерская линия (синяя)": [
        "Бурнаковская", "Стрелка", "Московская"
    ]
}

# КАЗАААНЬ
kazan_subway_stations = {
    "Центральная линия (зелёная)": [
        "Проспект Победы", "Горки", "Аметьево", "Суконная слобода",
        "Площадь Тукая", "Кремлёвская", "Козья слобода", "Яшьлек",
        "Северный вокзал", "Авиастроительная", "Дубравная"
    ]
}

# ЕКБ
ekaterinburg_subway_stations = {
    "Первая линия (синяя)": [
        "Проспект Космонавтов", "Уралмаш", "Машиностроителей", "Уральская",
        "Динамо", "Площадь 1905 года", "Геологическая", "Чкаловская",
        "Ботаническая"
    ]
}

# О А ЭТО МОЙ РОДНОЙ ГОРОД
samara_subway_stations = {
    "Первая линия (красная)": [
        "Юнгородок", "Кировская", "Безымянка", "Победа",
        "Советская", "Спортивная", "Гагаринская", "Московская",
        "Российская", "Алабинская"
    ]
}

